Revit 2026 API

# ThermalAssetGasViscosity Property

---

The gas viscosity of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GasViscosity { get; set; }
```
```vb
Public Property GasViscosity As Double
	Get
	Set
```
```cpp
public:
property double GasViscosity {
	double get ();
	void set (double value);
}
```
```fsharp
member GasViscosity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for gasViscosity must be non-negative. |
| InapplicableDataException | When setting this property: the asset must be gas to set this property. |

Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace